### Columns

In [1]:
import pandas as pd
d = {'one' : pd.Series([1, 2, 3]),
      'two' : pd.Series([1, 2, 3, 4])}

In [2]:
df=pd.DataFrame(d)
df

   one  two
0  1.0    1
1  2.0    2
2  3.0    3
3  NaN    4

In [6]:
df['Three']=pd.Series([10,20,30,40])

In [8]:
df['four']=df['one']+df['Three']

In [9]:
df

   one  two  Three  four
0  1.0    1     10  11.0
1  2.0    2     20  22.0
2  3.0    3     30  33.0
3  NaN    4     40   NaN

In [10]:
del df['one']

In [11]:
df

   two  Three  four
0    1     10  11.0
1    2     20  22.0
2    3     30  33.0
3    4     40   NaN

In [13]:
df.pop('Three')

0    10
1    20
2    30
3    40
Name: Three, dtype: int64

In [14]:
df

   two  four
0    1  11.0
1    2  22.0
2    3  33.0
3    4   NaN

### Rows

In [15]:
d = {'one' : pd.Series([11, 21, 31], index=['a', 'b', 'c']), 
     'two' : pd.Series([11, 22, 33, 44], index=['a', 'b', 'c', 'd'])}
df=pd.DataFrame(d)
df

    one  two
a  11.0   11
b  21.0   22
c  31.0   33
d   NaN   44

In [18]:
df=df.drop('d')
df

    one  two
a  11.0   11
b  21.0   22
c  31.0   33